tap "adoptopenjdk/openjdk", trusted: true
tap "corgibytes/cask-fonts", trusted: true
tap "hashicorp/tap", trusted: true
tap "homebrew/bundle", trusted: true
tap "johanhaleby/kubetail", trusted: true
tap "neovim/neovim", trusted: true
tap "weaveworks/tap", trusted: true
tap "azure/kubelogin", trusted:true
brew "argocd"
brew "coreutils"
brew "asdf"
brew "cryptography"
brew "python@3.12"
brew "awscli"
brew "azure-cli"
brew "libssh2"
brew "bat"
brew "bpytop"
brew "gettext"
brew "cmake"
brew "lima"
brew "colima"
brew "cowsay"
brew "ctags"
brew "rtmpdump"
brew "curl"
brew "diff-so-fancy"
brew "docker"
brew "erlang"
brew "libgit2"
brew "eza"
brew "fd"
brew "figlet"
brew "findutils"
brew "fortune"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-delta"
brew "glib"
brew "gnu-sed"
brew "libidn2"
brew "unbound"
brew "go"
brew "grep"
brew "hadolint"
brew "helm"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "krew"
brew "kube-ps1"
brew "kubectx"
brew "minikube"
brew "node"
brew "mongosh"
brew "moreutils"
brew "msgpack"
brew "neovim"
brew "nmap"
brew "okteto"
brew "openssl@3.0"
brew "hashicorp/tap/packer"
brew "pcre"
brew "perl"
brew "pre-commit"
brew "pyenv"
brew "pygments"
brew "python-yq", link: false
brew "python@3.10"
brew "python@3.11"
brew "python@3.9"
brew "qemu"
brew "rabbitmq"
brew "redis"
brew "ripgrep"
brew "ruby"
brew "shellcheck"
brew "shfmt"
brew "stylua"
brew "telnet"
brew "hashicorp/tap/terraform"
brew "terragrunt"
brew "the_silver_searcher"
brew "tlrc"
brew "tmux"
brew "tree"
brew "twine"
brew "virtualenv"
brew "watch"
brew "wget"
brew "yarn"
brew "yq"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "azure/kubelogin/kubelogin"
brew "hashicorp/tap/terraform-ls"
brew "johanhaleby/kubetail/kubetail", args: ["with-short-names"]
brew "weaveworks/tap/eksctl"
cask "adobe-acrobat-reader"
cask "temurin@8"
cask "alfred"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "karabiner-elements"
cask "vlc"
cask "wezterm"
cask "whatsapp"
cask "clipy"
