tap "adoptopenjdk/openjdk"
tap "azure/kubelogin"
tap "corgibytes/cask-fonts"
tap "hacker1024/hacker1024"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "johanhaleby/kubetail"
tap "neovim/neovim"
tap "spotinst/tap"
tap "weaveworks/tap"
brew "argocd"
brew "coreutils"
brew "asdf"
brew "python@3.11"
brew "awscli"
brew "azure-cli"
brew "libssh2"
brew "bat"
brew "berkeley-db", link: true
brew "python@3.12"
brew "bpytop"
brew "gettext"
brew "cmake"
brew "libidn2"
brew "cowsay"
brew "ctags"
brew "rtmpdump"
brew "curl"
brew "diff-so-fancy"
brew "docker"
brew "eza"
brew "fd"
brew "figlet"
brew "findutils"
brew "fortune"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "go"
brew "grep"
brew "hadolint"
brew "helm"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "krew"
brew "kube-ps1"
brew "kubectx"
brew "lastpass-cli"
brew "minikube"
brew "node"
brew "mongosh"
brew "moreutils"
brew "msgpack"
brew "neovim"
brew "nmap"
brew "openssl@1.1"
brew "packer"
brew "pcre"
brew "perl"
brew "pre-commit"
brew "pyenv"
brew "pygments"
brew "python-yq", link: false
brew "python@3.10"
brew "python@3.9"
brew "rabbitmq"
brew "redis"
brew "ripgrep"
brew "ruby"
brew "shellcheck"
brew "shfmt"
brew "stylua"
brew "telnet"
brew "terraform"
brew "terragrunt"
brew "the_silver_searcher"
brew "thefuck"
brew "tlrc"
brew "tmux"
brew "tree"
brew "twine"
brew "virtualenv"
brew "watch"
brew "wget"
brew "yarn"
brew "yq"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "azure/kubelogin/kubelogin"
brew "hacker1024/hacker1024/coretemp"
brew "hashicorp/tap/terraform-ls"
brew "johanhaleby/kubetail/kubetail", args: ["with-short-names"]
brew "spotinst/tap/oceancd"
brew "weaveworks/tap/eksctl", link: false
cask "adobe-acrobat-reader"
cask "adoptopenjdk8"
cask "alfred"
cask "disk-inventory-x"
cask "dropbox"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "karabiner-elements"
cask "keycastr"
cask "macpass"
cask "microsoft-remote-desktop"
cask "querious"
cask "sublime-text"
cask "whatsapp"
